<!-- Terraform Plan Result Comment -->
#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

Acquiring state lock. This may take a few moments...
module.gh_oidc.google_iam_workload_identity_pool.main: Refreshing state... [id=projects/cloud-run-template-naka/locations/global/workloadIdentityPools/github-actions]
google_service_account.github_actions: Refreshing state... [id=projects/cloud-run-template-naka/serviceAccounts/github-actions@cloud-run-template-naka.iam.gserviceaccount.com]
google_project_service.service["iam.googleapis.com"]: Refreshing state... [id=cloud-run-template-naka/iam.googleapis.com]
google_project_service.service["compute.googleapis.com"]: Refreshing state... [id=cloud-run-template-naka/compute.googleapis.com]
google_project_service.service["run.googleapis.com"]: Refreshing state... [id=cloud-run-template-naka/run.googleapis.com]
google_project_service.service["logging.googleapis.com"]: Refreshing state... [id=cloud-run-template-naka/logging.googleapis.com]
google_project_service.service["monitoring.googleapis.com"]: Refreshing state... [id=cloud-run-template-naka/monitoring.googleapis.com]
google_project_service.service["iamcredentials.googleapis.com"]: Refreshing state... [id=cloud-run-template-naka/iamcredentials.googleapis.com]
google_service_account.cloud_run: Refreshing state... [id=projects/cloud-run-template-naka/serviceAccounts/cloud-run-template@cloud-run-template-naka.iam.gserviceaccount.com]
google_project_service.service["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=cloud-run-template-naka/cloudresourcemanager.googleapis.com]
google_project_iam_member.cloud_run["roles/run.invoker"]: Refreshing state... [id=cloud-run-template-naka/roles/run.invoker/serviceAccount:cloud-run-template@cloud-run-template-naka.iam.gserviceaccount.com]
google_project_iam_member.cloud_run["roles/secretmanager.secretAccessor"]: Refreshing state... [id=cloud-run-template-naka/roles/secretmanager.secretAccessor/serviceAccount:cloud-run-template@cloud-run-template-naka.iam.gserviceaccount.com]
module.cloud_run.google_cloud_run_service.main: Refreshing state... [id=locations/asia-northeast1/namespaces/cloud-run-template-naka/services/cloud-run-template]
google_project_iam_member.github_actions["roles/iam.workloadIdentityUser"]: Refreshing state... [id=cloud-run-template-naka/roles/iam.workloadIdentityUser/serviceAccount:github-actions@cloud-run-template-naka.iam.gserviceaccount.com]
google_project_iam_member.github_actions["roles/resourcemanager.projectIamAdmin"]: Refreshing state... [id=cloud-run-template-naka/roles/resourcemanager.projectIamAdmin/serviceAccount:github-actions@cloud-run-template-naka.iam.gserviceaccount.com]
google_project_iam_member.github_actions["roles/iam.serviceAccountAdmin"]: Refreshing state... [id=cloud-run-template-naka/roles/iam.serviceAccountAdmin/serviceAccount:github-actions@cloud-run-template-naka.iam.gserviceaccount.com]
google_project_iam_member.github_actions["roles/run.developer"]: Refreshing state... [id=cloud-run-template-naka/roles/run.developer/serviceAccount:github-actions@cloud-run-template-naka.iam.gserviceaccount.com]
google_project_iam_member.github_actions["roles/storage.objectUser"]: Refreshing state... [id=cloud-run-template-naka/roles/storage.objectUser/serviceAccount:github-actions@cloud-run-template-naka.iam.gserviceaccount.com]
google_project_iam_member.github_actions["roles/serviceusage.serviceUsageViewer"]: Refreshing state... [id=cloud-run-template-naka/roles/serviceusage.serviceUsageViewer/serviceAccount:github-actions@cloud-run-template-naka.iam.gserviceaccount.com]
github_actions_secret.sa_email: Refreshing state... [id=cloud-run-app-template:SA_EMAIL]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # github_actions_secret.sa_email will be created
  + resource "github_actions_secret" "sa_email" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cloud-run-app-template"
      + secret_name     = "SA_EMAIL"
      + updated_at      = (known after apply)
    }

  # google_project_iam_member.github_actions["roles/iam.workloadIdentityPoolViewer"] will be created
  + resource "google_project_iam_member" "github_actions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-actions@cloud-run-template-naka.iam.gserviceaccount.com"
      + project = "cloud-run-template-naka"
      + role    = "roles/iam.workloadIdentityPoolViewer"
    }

  # google_project_iam_member.github_actions["roles/iam.workloadIdentityUser"] will be destroyed
  # (because key ["roles/iam.workloadIdentityUser"] is not in for_each map)
  - resource "google_project_iam_member" "github_actions" {
      - etag    = "BwYXiEAkO1k=" -> null
      - id      = "cloud-run-template-naka/roles/iam.workloadIdentityUser/serviceAccount:github-actions@cloud-run-template-naka.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:github-actions@cloud-run-template-naka.iam.gserviceaccount.com" -> null
      - project = "cloud-run-template-naka" -> null
      - role    = "roles/iam.workloadIdentityUser" -> null
    }

Plan: 2 to add, 0 to change, 1 to destroy.

```

</details>

*Pusher: @nakamasato, Action: `pull_request`, Working Directory: `terraform`, Workflow: `terraform`*